[
  {
    "id": 1,
    "title": "Creative Landing Page",
    "subtitle": "Create a seamless and engaging food ordering experience.",
    "category": "Web / Design",
    "slug": "creative-landing-page",
    "img": "/images/project-single.jpg",
    "description": "This project involved designing and developing a modern, responsive landing page aimed at boosting user engagement and conversions for a new product launch. The landing page features smooth scroll-triggered animations, a clean layout, and a compelling call-to-action. We focused heavily on accessibility, ensuring that the page works well on all devices and screen sizes. The design includes a dynamic hero section, product highlights, testimonials, and a fully functional lead capture form with client-side validation and error handling. Performance optimization was a key goal, so we used code-splitting and lazy loading techniques to minimize initial load times. Throughout development, we collaborated closely with the marketing team to align the visual identity and messaging, resulting in a polished final product that exceeded the client’s expectations.",

    "researchInsightsTitle": "Research & User Insights",
    "researchInsights": [
      "Understanding customer behavior through surveys and feedback.",
      "Analyzing user flow and refining the checkout process.",
      "Ensuring accessibility across all devices."
    ],

    "problemStatementTitle": "Problem Statement",
    "problemStatement": [
      "Users struggled with long, complex ordering steps.",
      "Mobile performance and clarity needed improvement."
    ],

    "featuresTitle": "Key Features",
    "features": [
      "Instant order confirmation and live tracking",
      "Multi-language support",
      "Admin dashboard for managing orders and menus"
    ],

    "techStackTitle": "Tech Stack",
    "techStack": ["HTML", "CSS", "JavaScript", "GSAP", "Tailwind CSS"],

    "liveUrl": "https://example.com/creative-landing",
    "githubUrl": "https://github.com/yourusername/creative-landing-page",

    "duration": "2 weeks",
    "role": "Frontend Developer",
    "client": "Internal UI/UX Team",
    "clientFeedback": "Working with this developer was a great experience. The delivery platform exceeded expectations!",
    "clientName": "GourmetHub CEO",
    "screenshots": ["/images/project-single.jpg", "/images/webdev.png"],
    "challengesTitle": "Challenges",
    "challenges": "Animating content without hurting performance across browsers.",

    "solutionTitle": "Solutions",
    "solution": "Used GSAP with optimized lazy loading, and removed unused CSS for performance."
  }
]
